Конфигурация отчетов/DataProcessors/ОтчетПоПиву.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПоПиву</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заведение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ОтчетПоПиву/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПолучитьНаСервере()
	Объект.ТЧ.Очистить();

	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.НачДата,Объект.КонДата);
	Пока Отчет.Следующий() Цикл
		
		Для Каждого Выборка Из Отчет.Накладные Цикл
			Если ЗначениеЗаполнено(Объект.Поставщик) Тогда
				Если Выборка.Поставщик = Объект.Поставщик Тогда
					Запись = Объект.ТЧ.Добавить();
					Запись.Заведение = Строка(Отчет.Заведение); 
					Запись.Дата = Отчет.ДатаСмены;
					Запись.Сумма = Строка(Выборка.Сумма);
				КонецЕсли;
			Иначе
				Запись = Объект.ТЧ.Добавить();
				Запись.Заведение = Строка(Отчет.Заведение); 
				Запись.Дата = Отчет.ДатаСмены;
				Запись.Сумма = Строка(Выборка.Сумма);
				Запись.Склад = Выборка.Поставщик.Склад;
				Запись.Поставщик = Выборка.Поставщик;

			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	ПолучитьНаСервере();
КонецПроцедуры
